title: Account Creation and Immediate Use
id: 7dfb4b44.b4nn4bn4.nb6n7nb.bnnrb8
status: experimental
description: Detects newly created accounts used shortly after creation
author: [Denis onduso]
date: 2025-12-18
tags:
  - attack.persistence
  - attack.t1136
logsource:
  product: windows
  service: security
detection:
  account_creation:
    EventID: 4720  # User created
  account_use:
    EventID: 4624  # Successful login
  timeframe: 1h
  condition: 
    - account_creation
    - account_use
    - within timeframe
falsepositives:
  - Normal account provisioning workflows
level: high
